In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame({'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo'})

In [4]:
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [5]:
df.T #Transpose of data frame

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [6]:
#sorting of data frame by axis 
df.sort_index(axis=1,ascending=False)# column of sorting

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [7]:
#sorting of data frame by axis

In [15]:
df.sort_values(by="B")

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [17]:
dates= pd.date_range('20130101', periods=6)

In [19]:
type(dates)# would give date time index

pandas.core.indexes.datetimes.DatetimeIndex

In [21]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [22]:
df

                   A         B         C         D
2013-01-01  0.573571  1.754429  1.523377 -0.658090
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370
2013-01-05  1.400282  0.092779 -0.270689  0.150095
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073

In [25]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [36]:
df.head (6)#first Five records by default

                   A         B         C         D
2013-01-01  0.573571  1.754429  1.523377 -0.658090
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370
2013-01-05  1.400282  0.092779 -0.270689  0.150095
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073

In [37]:
df.tail(3)#LAST THREE OF DATA FRAME

                   A         B         C         D
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370
2013-01-05  1.400282  0.092779 -0.270689  0.150095
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073

In [38]:
# HOW TO FIND OUT INDEX OF DATA FRAME

In [39]:
df.index #it is type of date index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [32]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.032284 -0.408840 -0.002218 -0.105047
std    1.717139  1.324764  0.885408  0.687693
min   -2.450486 -1.670639 -1.206330 -0.917871
25%   -1.249401 -1.501266 -0.253561 -0.526348
50%    0.330629 -0.505926 -0.114900 -0.126745
75%    1.193604  0.104570  0.120691  0.081979
max    1.890338  1.754429  1.523377  1.049073

In [41]:
#How to get column of data fram in numpy array just say converting into array

In [43]:
df.to_numpy()# to_numpy() does not include the index or column labels in the outpUT ONLY REVELENET DATA PART

array([[ 0.5735715 ,  1.75442883,  1.52337736, -0.65808998],
       [ 1.89033791, -1.63347714,  0.17012978, -0.13112016],
       [ 0.08768684, -1.6706391 , -0.20217526, -0.91787149],
       [-2.45048632,  0.10850031, -1.20632968, -0.12236951],
       [ 1.40028182,  0.0927792 , -0.27068925,  0.15009482],
       [-1.69509751, -1.10463209, -0.02762388,  1.04907331]])

In [44]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.032284 -0.408840 -0.002218 -0.105047
std    1.717139  1.324764  0.885408  0.687693
min   -2.450486 -1.670639 -1.206330 -0.917871
25%   -1.249401 -1.501266 -0.253561 -0.526348
50%    0.330629 -0.505926 -0.114900 -0.126745
75%    1.193604  0.104570  0.120691  0.081979
max    1.890338  1.754429  1.523377  1.049073

In [45]:
#TRANSPOSING OUR DATA FRAME

In [46]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.573571    1.890338    0.087687   -2.450486    1.400282   -1.695098
B    1.754429   -1.633477   -1.670639    0.108500    0.092779   -1.104632
C    1.523377    0.170130   -0.202175   -1.206330   -0.270689   -0.027624
D   -0.658090   -0.131120   -0.917871   -0.122370    0.150095    1.049073

In [47]:
#Sorting by an axis:

In [48]:
df.sort_index(axis=1,ascending=False)#1 means column

                   D         C         B         A
2013-01-01 -0.658090  1.523377  1.754429  0.573571
2013-01-02 -0.131120  0.170130 -1.633477  1.890338
2013-01-03 -0.917871 -0.202175 -1.670639  0.087687
2013-01-04 -0.122370 -1.206330  0.108500 -2.450486
2013-01-05  0.150095 -0.270689  0.092779  1.400282
2013-01-06  1.049073 -0.027624 -1.104632 -1.695098

In [49]:
df

                   A         B         C         D
2013-01-01  0.573571  1.754429  1.523377 -0.658090
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370
2013-01-05  1.400282  0.092779 -0.270689  0.150095
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073

In [50]:
# Sorting by values let say column B

In [56]:
df.sort_values(by='B',axis=0)

                   A         B         C         D
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073
2013-01-05  1.400282  0.092779 -0.270689  0.150095
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370
2013-01-01  0.573571  1.754429  1.523377 -0.658090

In [57]:
# 2.3.3 Selection

In [58]:
# one column selecction

In [60]:
df['B']

2013-01-01    1.754429
2013-01-02   -1.633477
2013-01-03   -1.670639
2013-01-04    0.108500
2013-01-05    0.092779
2013-01-06   -1.104632
Freq: D, Name: B, dtype: float64

In [61]:
# Selecting via [], which slices the rows

In [82]:
 df[0:3] # means only two row considering index start from 0

                   A         B         C         D
2013-01-01  0.573571  1.754429  1.523377 -0.658090
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871

In [83]:
#Selection by label

In [84]:
df.loc[dates[0]] #means index 0

A    0.573571
B    1.754429
C    1.523377
D   -0.658090
Name: 2013-01-01 00:00:00, dtype: float64

In [93]:
df.loc[dates[0]:dates[4],['A','B']]

                   A         B
2013-01-01  0.573571  1.754429
2013-01-02  1.890338 -1.633477
2013-01-03  0.087687 -1.670639
2013-01-04 -2.450486  0.108500
2013-01-05  1.400282  0.092779

In [94]:
df.loc[dates[0],['A','B']]

A    0.573571
B    1.754429
Name: 2013-01-01 00:00:00, dtype: float64

In [95]:
#For getting a scalar value:

In [96]:
df.loc[dates[0],list('ABC')]

A    0.573571
B    1.754429
C    1.523377
Name: 2013-01-01 00:00:00, dtype: float64

In [97]:
# For getting fast access to a scalar

In [98]:
df.at[dates[0], 'A']

0.5735714960976894

In [99]:
#integer slices, acting similar to numpy/python:

In [101]:
df.iloc[0] #first row of every every column

A    0.573571
B    1.754429
C    1.523377
D   -0.658090
Name: 2013-01-01 00:00:00, dtype: float64

In [102]:
df.iloc[0:2] # first two row of every every column

                   A         B         C        D
2013-01-01  0.573571  1.754429  1.523377 -0.65809
2013-01-02  1.890338 -1.633477  0.170130 -0.13112

In [103]:
df.iloc[3:4,0:2]#3,4 is index range and 0,2 is column

                   A       B
2013-01-04 -2.450486  0.1085

In [104]:
#By lists of integer position locations, similar to the numpy/python style:

In [106]:
df.iloc[[1,2,3],[1,2,3]]

                   B         C         D
2013-01-02 -1.633477  0.170130 -0.131120
2013-01-03 -1.670639 -0.202175 -0.917871
2013-01-04  0.108500 -1.206330 -0.122370

In [107]:
#For slicing rows explicitly:

In [109]:
df.iloc[1:] # mean all row

                   A         B         C         D
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370
2013-01-05  1.400282  0.092779 -0.270689  0.150095
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073

In [110]:
df.iloc[1:4]

                   A         B         C         D
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370

In [111]:
#For slicing columna explicitly:

In [119]:
df.iloc[:,:3]

                   A         B         C
2013-01-01  0.573571  1.754429  1.523377
2013-01-02  1.890338 -1.633477  0.170130
2013-01-03  0.087687 -1.670639 -0.202175
2013-01-04 -2.450486  0.108500 -1.206330
2013-01-05  1.400282  0.092779 -0.270689
2013-01-06 -1.695098 -1.104632 -0.027624

In [120]:
# For getting a value explicitly:

In [123]:
df.iloc[1,1] # index 1 and 2nd column value

-1.6334771377945532

In [124]:
#For getting fast access to a scalar (equivalent to the prior method):

In [125]:
df.iat[1,1]

-1.6334771377945532

In [126]:
# Boolean indexing

In [127]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.573571  1.754429  1.523377 -0.658090
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-05  1.400282  0.092779 -0.270689  0.150095

In [129]:
df['A']>0

2013-01-01     True
2013-01-02     True
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [133]:
df>0 #unmatch conditoon will be treated as false

                A      B      C      D
2013-01-01   True   True   True  False
2013-01-02   True  False   True  False
2013-01-03   True  False  False  False
2013-01-04  False   True  False  False
2013-01-05   True   True  False   True
2013-01-06  False  False  False   True

In [135]:
df[df>0]#it will be denoted as NAN where condition didn't meet

                   A         B         C         D
2013-01-01  0.573571  1.754429  1.523377       NaN
2013-01-02  1.890338       NaN  0.170130       NaN
2013-01-03  0.087687       NaN       NaN       NaN
2013-01-04       NaN  0.108500       NaN       NaN
2013-01-05  1.400282  0.092779       NaN  0.150095
2013-01-06       NaN       NaN       NaN  1.049073

In [136]:
df2= df.copy()

In [137]:
df2

                   A         B         C         D
2013-01-01  0.573571  1.754429  1.523377 -0.658090
2013-01-02  1.890338 -1.633477  0.170130 -0.131120
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370
2013-01-05  1.400282  0.092779 -0.270689  0.150095
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073

In [138]:
#ADDING NEW COLUMN TO THE DATA FRAME 
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [140]:
df2

                   A         B         C         D      E
2013-01-01  0.573571  1.754429  1.523377 -0.658090    one
2013-01-02  1.890338 -1.633477  0.170130 -0.131120    one
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871    two
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370  three
2013-01-05  1.400282  0.092779 -0.270689  0.150095   four
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073  three

In [141]:
#Using the isin() method for filtering:

In [156]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871   two
2013-01-05  1.400282  0.092779 -0.270689  0.150095  four

In [157]:
#Setting a new column automatically aligns the data by the indexes

In [158]:
s1= pd.Series(list(range(1,7)),index=pd.date_range('20130102',periods=6))

In [159]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [160]:
# setting new column

In [161]:
df['F']=s1

In [162]:
df

                   A         B         C         D    F
2013-01-01  0.573571  1.754429  1.523377 -0.658090  NaN
2013-01-02  1.890338 -1.633477  0.170130 -0.131120  1.0
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871  2.0
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370  3.0
2013-01-05  1.400282  0.092779 -0.270689  0.150095  4.0
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073  5.0

In [163]:
# Setting values by label:

In [165]:
df.at[dates[0],'A']=0

In [166]:
df

                   A         B         C         D    F
2013-01-01  0.000000  1.754429  1.523377 -0.658090  NaN
2013-01-02  1.890338 -1.633477  0.170130 -0.131120  1.0
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871  2.0
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370  3.0
2013-01-05  1.400282  0.092779 -0.270689  0.150095  4.0
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073  5.0

In [167]:
# Setting values by position

In [168]:
df.iat[0,1]=0

In [169]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.523377 -0.658090  NaN
2013-01-02  1.890338 -1.633477  0.170130 -0.131120  1.0
2013-01-03  0.087687 -1.670639 -0.202175 -0.917871  2.0
2013-01-04 -2.450486  0.108500 -1.206330 -0.122370  3.0
2013-01-05  1.400282  0.092779 -0.270689  0.150095  4.0
2013-01-06 -1.695098 -1.104632 -0.027624  1.049073  5.0

In [170]:
# Setting by assigning with a NumPy array:

In [171]:
df.loc[:,'D']=np.array([5]*len(df))

In [174]:
len(df)# Provide number of row in data frame

6

In [176]:
df.loc[:,'D']=np.array([5]*len(df))

In [178]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.523377  5  NaN
2013-01-02  1.890338 -1.633477  0.170130  5  1.0
2013-01-03  0.087687 -1.670639 -0.202175  5  2.0
2013-01-04 -2.450486  0.108500 -1.206330  5  3.0
2013-01-05  1.400282  0.092779 -0.270689  5  4.0
2013-01-06 -1.695098 -1.104632 -0.027624  5  5.0

In [179]:
#A where operation with setting

In [180]:
df2= df.copy()

In [182]:
df2[df2 > 0] = -df2

In [183]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.523377 -5  NaN
2013-01-02 -1.890338 -1.633477 -0.170130 -5 -1.0
2013-01-03 -0.087687 -1.670639 -0.202175 -5 -2.0
2013-01-04 -2.450486 -0.108500 -1.206330 -5 -3.0
2013-01-05 -1.400282 -0.092779 -0.270689 -5 -4.0
2013-01-06 -1.695098 -1.104632 -0.027624 -5 -5.0

In [184]:
# 2.3.4 Missing data

In [185]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [186]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  1.523377  5  NaN NaN
2013-01-02  1.890338 -1.633477  0.170130  5  1.0 NaN
2013-01-03  0.087687 -1.670639 -0.202175  5  2.0 NaN
2013-01-04 -2.450486  0.108500 -1.206330  5  3.0 NaN

In [196]:
df1.iloc[0:2,5:]=1

In [197]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.523377  5  NaN  1.0
2013-01-02  1.890338 -1.633477  0.170130  5  1.0  1.0
2013-01-03  0.087687 -1.670639 -0.202175  5  2.0  NaN
2013-01-04 -2.450486  0.108500 -1.206330  5  3.0  NaN

In [198]:
# To drop any rows that have missing data.

In [200]:
df1.dropna(how='any')

                   A         B        C  D    F    E
2013-01-02  1.890338 -1.633477  0.17013  5  1.0  1.0

In [201]:
# Filling missing data.

In [203]:
df1.fillna(value='5')

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000  1.523377  5  5  1
2013-01-02  1.890338 -1.633477  0.170130  5  1  1
2013-01-03  0.087687 -1.670639 -0.202175  5  2  5
2013-01-04 -2.450486  0.108500 -1.206330  5  3  5

In [204]:
# To get the boolean mask where values are nan

In [205]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True